In [30]:
import pandas as pd

In [31]:
var1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})

In [32]:
var2=pd.DataFrame({"A":[1,2,3,5],"C":[15,16,17,18]})

In [33]:
df=pd.merge(var1,var2,on="A")
df

   A   B   C
0  1  11  15
1  2  12  16
2  3  13  17

In [34]:
df2=pd.merge(var1,var2,how="outer")
df2

   A     B     C
0  1  11.0  15.0
1  2  12.0  16.0
2  3  13.0  17.0
3  4  14.0   NaN
4  5   NaN  18.0

In [35]:
df2=pd.merge(var1,var2,how="inner")
df2

   A   B   C
0  1  11  15
1  2  12  16
2  3  13  17

In [36]:
df2=pd.merge(var1,var2,how="left")
df2

   A   B     C
0  1  11  15.0
1  2  12  16.0
2  3  13  17.0
3  4  14   NaN

In [37]:
df2=pd.merge(var1,var2,how="right")
df2

   A     B   C
0  1  11.0  15
1  2  12.0  16
2  3  13.0  17
3  5   NaN  18

In [38]:
df3=pd.merge(var1,var2,how="outer",indicator=True)
df3

   A     B     C      _merge
0  1  11.0  15.0        both
1  2  12.0  16.0        both
2  3  13.0  17.0        both
3  4  14.0   NaN   left_only
4  5   NaN  18.0  right_only

In [39]:
df4=pd.merge(var1,var2,left_index=True,right_index=True)
df4

   A_x   B  A_y   C
0    1  11    1  15
1    2  12    2  16
2    3  13    3  17
3    4  14    5  18

In [49]:
df5=pd.merge(var1,var2,left_index=True,right_index=True,suffixes=(" abra","dabra"))
df5

   A abra   B  Adabra   C
0       1  11       1  15
1       2  12       2  16
2       3  13       3  17
3       4  14       5  18

concat

In [46]:
ser1=pd.Series([1,2,3,4])
ser1

0    1
1    2
2    3
3    4
dtype: int64

In [47]:
ser2=pd.Series([11,21,31,41])
ser2

0    11
1    21
2    31
3    41
dtype: int64

In [45]:
ser=pd.concat([ser1,ser2])
ser

0     1
1     2
2     3
3     4
0    11
1    21
2    31
3    41
dtype: int64

In [48]:
df6=pd.concat([var1,var2])
df6

   A     B     C
0  1  11.0   NaN
1  2  12.0   NaN
2  3  13.0   NaN
3  4  14.0   NaN
0  1   NaN  15.0
1  2   NaN  16.0
2  3   NaN  17.0
3  5   NaN  18.0

In [51]:
df7=pd.concat([var1,var2],axis=1)
df7

   A   B  A   C
0  1  11  1  15
1  2  12  2  16
2  3  13  3  17
3  4  14  5  18

In [52]:
var3=pd.DataFrame({"A":[1,2],"C":[15,16]})
df8=pd.concat([var1,var3],axis=1)
df8

   A   B    A     C
0  1  11  1.0  15.0
1  2  12  2.0  16.0
2  3  13  NaN   NaN
3  4  14  NaN   NaN

In [53]:
df9=pd.concat([var1,var3],axis=1,join="outer")
df9

   A   B    A     C
0  1  11  1.0  15.0
1  2  12  2.0  16.0
2  3  13  NaN   NaN
3  4  14  NaN   NaN

In [54]:
df9=pd.concat([var1,var3],axis=1,join="inner")
df9

   A   B  A   C
0  1  11  1  15
1  2  12  2  16